[
    {"id": 1,
"name": "Heavenly Balance",
"hook": "It's difficult to find balance when that word is invoked to rape and kill. From facing a pantheon bent on exercising the equilibrium of existence on their own terms and for their own ends, to struggling with the debilitating weaknesses that send her into excesses of suffering and self-sacrifice, Artemis is on a journey to find what it truly means to participate in the ever-shifting balance of the universe. She must find her balance, else existence as she knows it may very well end.",
"chapter":[
    {
        "name": "Alice",
        "part":[
            {
                "name": "Retrieval",
                "text": "With a solemn breath, Artemis tears her gaze away from Olympus. She departs from the cliff edge she was sitting at just moments ago, taking with her the hunting hounds which followed. They eat delicious meat from her hands as they stroll, their reward for their company and service. They're not as alert of the incoming divinity diving from the heavens as Artemis is, and she wishes their spiritual insensitivity was her own so that dreaded sisterly meetings would not hunt her mind as she hunts deer. Artemis does well to keep her walk calm and steady, if not to calm herself, then to keep the nature around her at ease. Yet, some look up and stare, some crawl or prance away, an innate, innocent, vague wariness of what is coming dawning on them. The metal is what hits her nose first. Artemis herself has a few pieces of prized armor which she equips for a variety of situations, but it's hardly a full-bodied set of protective equipment, let alone the gaudy regalia some of her family members forged to satisfy their vanity. The clever woman descending upon Artemis' precious hunting grounds is of a humble disposition, but her warbound status keeps her around unsavory egoism;  although her fashion shows respect for Artemis' abode today, the stink of wrought iron, silver, and gold sticks to her as if bitterly seeking to offend anything she meets. No amount of sweet perfumes can mask that. Artemis is even a little upset that Athena would even try. \"You know, you only smell worse now,\" Artemis begins, not even giving Athena the chance to visibly present herself, let alone provide a greeting. \"Do I really? The animals seem not to mind…\" Athena looks around at the squirrels bounding by her feet, and the wolves crossing the path between herself and her sister. \"What do you want?\" Artemis asks directly with a characteristic edge to her tone. Athena is all too familiar with this casually irreverent attitude of hers, and how it is especially prone to intensity when anticipating family business. \"For you to sleep more often. Preferably around your family on Olympus, at home. We do miss you,\" Athena appeals. Artemis remembers how she looked about an hour ago as she was hunting by a lakeside. The bags under her eyes were not incredibly obvious, but someone like Athena, who has seen Artemis in better days, can certainly tell the difference. \"It is difficult when that same family is the one depriving me of sleep even when I am away. I am not arguing with you about going to Olympus again. This is my home, not that sky throne.\" \"Well, I certainly did not come to argue, Artemis. I know we are past that stage. I just wanted to inform you that we will be meeting on a topic you might want to be present for.\" \"You all hardly talk about anything worth listening to,\" Artemis replies as she begins to walk past Athena. \"The planet of Plyscithia has caught our father's attention,\" Athena's lips curve into a small smile, her eyes tracking her sister as she walks past. \"He is brewing a punishment,\" she adds. Her smile grows further when she hears Artemis no longer crunching grass under defiant steps. \"For what.\" \"You'll have to find out at the meeting. Not even I know,\" Athena answers with a sigh. She isn't upset at her ignorance, merely glad that she was able to bait Artemis into spending more time around her. Artemis does not share this relief. Rather, she feels as if she is taking bait to embarrass herself once again. The futility of her protests against the unjustified abuses of her family are overridden by her commitment to holistic justice. However, she would feel worse being absent as the fate of a world is decided than if her resistance is trampled over and discarded as immaturity. This is how it always is. This is how it must be. \"I'll be there.\""
            },
            {
                "name": "Plyscithia",
                "text": "\"My darling, lost daughter of the woods. How wonderful it is to see you here after so long,\" Zeus gushes from the throne across her. For as comforting as being flanked by the warm presences of Demeter and Hestia is, being directly across autocrats and warmongers ruins the entire vibe. Her ears are blessed by the comforts of nature and the hearth, while her eyes are invaded by the ugliness of unjust royalty and force. \"So lost, I ended up here again,\" Artemis sneers. \"I notice not everyone is present. Is this really all that serious, Athena? Or did you waste my time again.\" \"Athena, I thought you were clever enough to talk the childish rebelliousness out of her over these past few months,\" Poseidon says, gesturing his complaint with a hand waved towards Artemis. \"Clever enough I am, but whether or not I want to is a different matter,\" Athena admits. \"She is here and that is all that is necessary, one way or another.\" \"Oh? And what makes you so headstrong as to defer something that would undoubtedly benefit our cooperation as a family?\" Poseidon interrogates. \"Now, perhaps we don’t need to always see eye-to-eye in order to work as a family-\" \"Enough of this banter. We are gathered already, so we will discuss the matter at hand promptly, and we will see how we work through this like the family we ought to be,\" Zeus cuts off Hestia as he refocuses the conversation. \"As all things should be balanced, so too will our final decision be, especially as it is refined through our thoughts and my final judgement.\" Athena ignores Poseidon’s glare, and Poseidon ignores Hestia’s general concern, as Athena walks to the middle of the circle of thrones and sprouts an olive tree. It grows thick and quick, with multiple trunks twisting and converging. They split apart at their wooden seams to blossom a wide bush of branches. The branches curve outward, and the big bush of leaves they collectively produce shimmer to present a three dimensional image of the cosmos. Small bunches of olives glow, representing the stars. Athena deftly adjusts the view of space, zooming in on the planet of interest, Plyscithia, until it is large and clear for all to see. \"As you all know, we are here to discuss the fate of Plyscithia and its denizens. Our interest is multi-faceted. On the one end, we have received word that the balance among the Elysian and Infernal dominions is shifting unfavorably, and we have been encouraged to be among the few pantheons and other divine organizations to correct it. Fortunately, the transgressions of some Plyscithian civilizations make them a convenient way to tip the scales,\" Athena introduces to the ring around her. Zeus follows up immediately, joining her at the olive tree display. \"Poseidon and Apollo have, unsurprisingly, caught themselves up in a number of political and personal incidents on the planet. We are no strangers to these kinds of incidents, and certainly understand how to especially handle those who blaspheme as an unreasonable response-\" \"Describe the incidents and the responses of the mortal parties involved,\" Artemis demands before he can continue. Zeus pauses for a moment, and looks around to the other gods and goddesses. Apollo turns his head away in some shame, and Poseidon’s glare now darts between Athena and Artemis. He is gripping his trident tighter. The others also are silent, but are clearly bracing themselves for the coming disagreement. \"As you wish, my child. Your uncle found himself in a number of entanglements. Being the busy man he is, he was unable to keep them all in order – especially his more forceful conquests. Government action and even magic arts have been summoned against him due to what they label as vicious crimes against the sanctity of-\" \"Sanctity- What do these grains of sand and amalgams of dirt know about sanctity to so heinously curse me, who is above and beyond them. The wrath of the sea will drown them yet-\" \"Order, Poseidon-\" \"Especially those unwilling wenches, so disrespectful are they to deny me both my claim and their own blessing of my attention, and then venturing further to outright attempt ridiculou-\" \"ORDER, Poseidon!\" Zeus’ voice is a thunderclap which tames his brother, disciplining the frothing, violent storm that was developing. \"I will have no more interruption. From any of you,\" Zeus declares, his eyes traveling the thrones. Despite this declaration, he knew who exactly might explode next. She is simply hunting for the right moment. He can also sense her hunting down information. \"Onto Apollo, your brother was swept up in his passions and made mistakes in his pursuit of a charming young woman,\" Zeus can tell Artemis is almost ready to strike. \"Much unlike your gentle moon glow...\" he continues, trying to soothe her a little bit. \"...his intense, bright sun shares its radiance with all those it touches, and, like a heat wave, his passions also became those of several others. Blameless, under this powerful influence, men and women alike pursued one another with an addictive vigor much like that of your dear sibling, with the only difference being the hindrances of mortality-\" \"And now, between mass rape, the facilitation of genocide through scapegoating actually innocent subgroups already facing persecution on the basis of sexuality, and general moral irresponsibility, there is a popular movement taking place rallying against not only several of Apollo’s chosen on Plyscithia, but also against Apollo himself,\" Artemis finishes for Zeus. Apollo looks towards his sister for the first time during the meeting, a hopeful look on his face. It is sniped down by the mortifying arrows in her pupils. \"I take it that, since you understand the situation so well, that you have some sympathy at least for your blood brother-\" \"I take it you still don’t understand your own blood daughter, even though time and again she has rallied against situations like these. Whatever you lot are planning to do to Plyscithia, you already know I disagree. Not that it matters anyway, because this \"balance\" you all are so obsessed with apparently overrides any sense of justice you truly have,\" the you in that final statement is pointedly limited to Zeus. Try as he might to mask the pain he feels from Artemis’ daggers plunging into his core, he can’t. \"Well, not only do I feel second-hand embarrassment from my brother’s poorly-behaved daughter’s theatrics on the hallowed grounds she hardly ever steps foot in, I also feel downright stupid for ever believing that I could expect you to put some sense into some of your Plyscithian women for their blasphemy,\" Poseidon sighs. \"Several of the women you treated like fertile land to flood are now experiencing unnecessarily insufferable childbirths from the sewage you dumped into their bodies. I would sooner go down there myself and bring ease to those women by ripping your poison out and having their premature remains decorate my bow, than to ever even think about blaming them-\" Artemis is cut off by a sudden, breathtaking agony which blossoms in her chest. Only her expression reveals this, her voice having gone mute. Tears immediately begin to flow from her eyes. \"All but one are in favor of punishment on Plyscithia,\" Athena announces. \"What- what are you- so much fire, and screaming-\" \"It is settled,\" Zeus booms above Artemis’ suffering. \"What is-\" Artemis loses feeling in her legs, and she collapses to the floor. She can barely hold herself up and grip her chest at the same time. Hestia and Demeter fall to her aid as well. Athena concentrates especially hard on the display of the planet’s violent events, Zeus converses with Poseidon while the latter occasionally casts a cruel smile in Artemis’ direction, and Apollo has seen himself out altogether. \"The decision has been made to punish those who defame and wish ill upon members of the pantheon,\" Demeter explains, her voice also pained. \"A part of the punishment involves...severe, planet-wide environmental degradation, as well as influencing civilizations of Plyscithia to enhance cruel governance against that and those which Poseidon’s and Apollo’s detractors hold dear.\" \"We knew you would likely disagree, and the vote would be in favor of the men, so some of those absent today were preparing to deal the blow to Plyscithia as we conversed,\" Athena admits flatly. At this, Artemis finds the strength to get her legs together, and draw focus away from her pain to embrace rage. \"This is pure insanity! They’ve never dealt with things so harshly, so broadly! Why aren’t you both rebelling against this, they’re attacking your charges directly as well!\" She looks at both Hestia and Demeter who, for all the pain they’re clearly enduring, show little in the way of outspoken disagreement. \"Because they are good, grown, sensible women. Unlike you, you sniveling child,\" Poseidon stands up and flexes his muscles, adjusting his grip on the trident. \"Athena!\" Artemis calls out, attempting to appeal to her sister. Athena doesn’t respond as the olive tree display produces two giant olives. She takes them, bursts them in her hands, and the juices flow across her body to form armor. \"Artemis, please, for once understand that what must be done must be done,\" Zeus pleads. \"Understand? What is there to understand? All I see is the impulsive punishment of the innocent, and this supposed gleaming beacon of wisdom finding all this justified,\" Artemis didn’t spare a glance to her father, keeping her eyes trained on Athena, trying to will those olive roots to sprout and root her feet to Olympus. \"Artemis, I have been far more patient with you than I should have been because I love you. Now quit this animosity you are building between you and your family,\" Zeus says in a tone of warning. \"Animosity? I will show you what animosity really is when I meet you on Plyscithia,\" Artemis shoots back, a wild ferocity sharpening her eyes. \"No! You wouldn’t dare stand against your father!?\" Hestia looks up from her kneeling position. Artemis glances down at her, and is disgusted by how weak, pitiful, and helpless she looks. \"I will have order in my home, Artemis, and I will spare you no mercy if you lash out this way. I demand that you either follow the lead of your aunts and standby, or, better yet, follow the lead of your reasonable sister, and assist in this operation,\" Zeus says. \"Reasonable? A cleverness that sells the dignity of others just to suck up to a fount of hypocrisy is reasonable?\" \"You will be expelled from Olympus, and cast out from our family indefinitely, if you follow through with your suggestion. I will not hesitate, even on my own flesh and blood,\" Zeus promises, sending Hestia into a fit. Demeter rushes to assist her sister, leaving Artemis standing alone. Artemis balls her fists up in absolute frustration. Tears have been streaming down her face this entire time, but it feels as if a fresh flood erupted. Through the blurriness, she can hardly see Athena anymore. The shine of her armor is the most visible."
            }
        ]
    }
] }
]