[
    {"id": 1,
"name": "Heavenly Balance",
"hook": "It's difficult to find balance when that word is invoked to rape and kill. From facing a pantheon bent on exercising the equilibrium of existence on their own terms and for their own ends, to struggling with the debilitating weaknesses that send her into excesses of suffering and self-sacrifice, Artemis is on a journey to find what it truly means to participate in the ever-shifting balance of the universe. She must find her balance, else existence as she knows it may very well end.",
"chapter":[
    {
        "name": "Alice",
        "part":[
            {
                "name": "Retrieval",
                "text": "With a solemn breath, Artemis tears her gaze away from Olympus. She departs from the cliff edge she was sitting at just moments ago, taking with her the hunting hounds which followed. They eat delicious meat from her hands as they stroll, their reward for their company and service. They're not as alert of the incoming divinity diving from the heavens as Artemis is, and she wishes their spiritual insensitivity was her own so that dreaded sisterly meetings would not hunt her mind as she hunts deer. Artemis does well to keep her walk calm and steady, if not to calm herself, then to keep the nature around her at ease. Yet, some look up and stare, some crawl or prance away, an innate, innocent, vague wariness of what is coming dawning on them. The metal is what hits her nose first. Artemis herself has a few pieces of prized armor which she equips for a variety of situations, but it's hardly a full-bodied set of protective equipment, let alone the gaudy regalia some of her family members forged to satisfy their vanity. The clever woman descending upon Artemis' precious hunting grounds is of a humble disposition, but her warbound status keeps her around unsavory egoism;  although her fashion shows respect for Artemis' abode today, the stink of wrought iron, silver, and gold sticks to her as if bitterly seeking to offend anything she meets. No amount of sweet perfumes can mask that. Artemis is even a little upset that Athena would even try. \"You know, you only smell worse now,\" Artemis begins, not even giving Athena the chance to visibly present herself, let alone provide a greeting. \"Do I really? The animals seem not to mind…\" Athena looks around at the squirrels bounding by her feet, and the wolves crossing the path between herself and her sister. \"What do you want?\" Artemis asks directly with a characteristic edge to her tone. Athena is all too familiar with this casually irreverent attitude of hers, and how it is especially prone to intensity when anticipating family business. \"For you to sleep more often. Preferably around your family on Olympus, at home. We do miss you,\" Athena appeals. Artemis remembers how she looked about an hour ago as she was hunting by a lakeside. The bags under her eyes were not incredibly obvious, but someone like Athena, who has seen Artemis in better days, can certainly tell the difference. \"It is difficult when that same family is the one depriving me of sleep even when I am away. I am not arguing with you about going to Olympus again. This is my home, not that sky throne.\" \"Well, I certainly did not come to argue, Artemis. I know we are past that stage. I just wanted to inform you that we will be meeting on a topic you might want to be present for.\" \"You all hardly talk about anything worth listening to,\" Artemis replies as she begins to walk past Athena. \"The planet of Plyscithia has caught our father's attention,\" Athena's lips curve into a small smile, her eyes tracking her sister as she walks past. \"He is brewing a punishment,\" she adds. Her smile grows further when she hears Artemis no longer crunching grass under defiant steps. \"For what.\" \"You'll have to find out at the meeting. Not even I know,\" Athena answers with a sigh. She isn't upset at her ignorance, merely glad that she was able to bait Artemis into spending more time around her. Artemis does not share this relief. Rather, she feels as if she is taking bait to embarrass herself once again. The futility of her protests against the unjustified abuses of her family are overridden by her commitment to holistic justice. However, she would feel worse being absent as the fate of a world is decided than if her resistance is trampled over and discarded as immaturity. This is how it always is. This is how it must be. \"I'll be there.\""
            },
            {
                "name": "Plyscithia",
                "text": "\"My darling, lost daughter of the woods. How wonderful it is to see you here after so long,\" Zeus gushes from the throne across her. For as comforting as being flanked by the warm presences of Demeter and Hestia is, being directly across autocrats and warmongers ruins the entire vibe. Her ears are blessed by the comforts of nature and the hearth, while her eyes are invaded by the ugliness of unjust royalty and force. \"So lost, I ended up here again,\" Artemis sneers. \"I notice not everyone is present. Is this really all that serious, Athena? Or did you waste my time again.\" \"Athena, I thought you were clever enough to talk the childish rebelliousness out of her over these past few months,\" Poseidon says, gesturing his complaint with a hand waved towards Artemis. \"Clever enough I am, but whether or not I want to is a different matter,\" Athena admits. \"She is here and that is all that is necessary, one way or another.\" \"Oh? And what makes you so headstrong as to defer something that would undoubtedly benefit our cooperation as a family?\" Poseidon interrogates. \"Now, perhaps we don’t need to always see eye-to-eye in order to work as a family-\" \"Enough of this banter. We are gathered already, so we will discuss the matter at hand promptly, and we will see how we work through this like the family we ought to be,\" Zeus cuts off Hestia as he refocuses the conversation. \"As all things should be balanced, so too will our final decision be, especially as it is refined through our thoughts and my final judgement.\" Athena ignores Poseidon’s glare, and Poseidon ignores Hestia’s general concern, as Athena walks to the middle of the circle of thrones and sprouts an olive tree. It grows thick and quick, with multiple trunks twisting and converging. They split apart at their wooden seams to blossom a wide bush of branches. The branches curve outward, and the big bush of leaves they collectively produce shimmer to present a three dimensional image of the cosmos. Small bunches of olives glow, representing the stars. Athena deftly adjusts the view of space, zooming in on the planet of interest, Plyscithia, until it is large and clear for all to see. \"As you all know, we are here to discuss the fate of Plyscithia and its denizens. Our interest is multi-faceted. On the one end, we have received word that the balance among the Elysian and Infernal dominions is shifting unfavorably, and we have been encouraged to be among the few pantheons and other divine organizations to correct it. Fortunately, the transgressions of some Plyscithian civilizations make them a convenient way to tip the scales,\" Athena introduces to the ring around her. Zeus follows up immediately, joining her at the olive tree display. \"Poseidon and Apollo have, unsurprisingly, caught themselves up in a number of political and personal incidents on the planet. We are no strangers to these kinds of incidents, and certainly understand how to especially handle those who blaspheme as an unreasonable response-\" \"Describe the incidents and the responses of the mortal parties involved,\" Artemis demands before he can continue. Zeus pauses for a moment, and looks around to the other gods and goddesses. Apollo turns his head away in some shame, and Poseidon’s glare now darts between Athena and Artemis. He is gripping his trident tighter. The others also are silent, but are clearly bracing themselves for the coming disagreement. \"As you wish, my child. Your uncle found himself in a number of entanglements. Being the busy man he is, he was unable to keep them all in order – especially his more forceful conquests. Government action and even magic arts have been summoned against him due to what they label as vicious crimes against the sanctity of-\" \"Sanctity- What do these grains of sand and amalgams of dirt know about sanctity to so heinously curse me, who is above and beyond them. The wrath of the sea will drown them yet-\" \"Order, Poseidon-\" \"Especially those unwilling wenches, so disrespectful are they to deny me both my claim and their own blessing of my attention, and then venturing further to outright attempt ridiculou-\" \"ORDER, Poseidon!\" Zeus’ voice is a thunderclap which tames his brother, disciplining the frothing, violent storm that was developing. \"I will have no more interruption. From any of you,\" Zeus declares, his eyes traveling the thrones. Despite this declaration, he knew who exactly might explode next. She is simply hunting for the right moment. He can also sense her hunting down information. \"Onto Apollo, your brother was swept up in his passions and made mistakes in his pursuit of a charming young woman,\" Zeus can tell Artemis is almost ready to strike. \"Much unlike your gentle moon glow...\" he continues, trying to soothe her a little bit. \"...his intense, bright sun shares its radiance with all those it touches, and, like a heat wave, his passions also became those of several others. Blameless, under this powerful influence, men and women alike pursued one another with an addictive vigor much like that of your dear sibling, with the only difference being the hindrances of mortality-\" \"And now, between mass rape, the facilitation of genocide through scapegoating actually innocent subgroups already facing persecution on the basis of sexuality, and general moral irresponsibility, there is a popular movement taking place rallying against not only several of Apollo’s chosen on Plyscithia, but also against Apollo himself,\" Artemis finishes for Zeus. Apollo looks towards his sister for the first time during the meeting, a hopeful look on his face. It is sniped down by the mortifying arrows in her pupils. \"I take it that, since you understand the situation so well, that you have some sympathy at least for your blood brother-\" \"I take it you still don’t understand your own blood daughter, even though time and again she has rallied against situations like these. Whatever you lot are planning to do to Plyscithia, you already know I disagree. Not that it matters anyway, because this \"balance\" you all are so obsessed with apparently overrides any sense of justice you truly have,\" the you in that final statement is pointedly limited to Zeus. Try as he might to mask the pain he feels from Artemis’ daggers plunging into his core, he can’t. \"Well, not only do I feel second-hand embarrassment from my brother’s poorly-behaved daughter’s theatrics on the hallowed grounds she hardly ever steps foot in, I also feel downright stupid for ever believing that I could expect you to put some sense into some of your Plyscithian women for their blasphemy,\" Poseidon sighs. \"Several of the women you treated like fertile land to flood are now experiencing unnecessarily insufferable childbirths from the sewage you dumped into their bodies. I would sooner go down there myself and bring ease to those women by ripping your poison out and having their premature remains decorate my bow, than to ever even think about blaming them-\" Artemis is cut off by a sudden, breathtaking agony which blossoms in her chest. Only her expression reveals this, her voice having gone mute. Tears immediately begin to flow from her eyes. \"All but one are in favor of punishment on Plyscithia,\" Athena announces. \"What- what are you- so much fire, and screaming-\" \"It is settled,\" Zeus booms above Artemis’ suffering. \"What is-\" Artemis loses feeling in her legs, and she collapses to the floor. She can barely hold herself up and grip her chest at the same time. Hestia and Demeter fall to her aid as well. Athena concentrates especially hard on the display of the planet’s violent events, Zeus converses with Poseidon while the latter occasionally casts a cruel smile in Artemis’ direction, and Apollo has seen himself out altogether. \"The decision has been made to punish those who defame and wish ill upon members of the pantheon,\" Demeter explains, her voice also pained. \"A part of the punishment involves...severe, planet-wide environmental degradation, as well as influencing civilizations of Plyscithia to enhance cruel governance against that and those which Poseidon’s and Apollo’s detractors hold dear.\" \"We knew you would likely disagree, and the vote would be in favor of the men, so some of those absent today were preparing to deal the blow to Plyscithia as we conversed,\" Athena admits flatly. At this, Artemis finds the strength to get her legs together, and draw focus away from her pain to embrace rage. \"This is pure insanity! They’ve never dealt with things so harshly, so broadly! Why aren’t you both rebelling against this, they’re attacking your charges directly as well!\" She looks at both Hestia and Demeter who, for all the pain they’re clearly enduring, show little in the way of outspoken disagreement. \"Because they are good, grown, sensible women. Unlike you, you sniveling child,\" Poseidon stands up and flexes his muscles, adjusting his grip on the trident. \"Athena!\" Artemis calls out, attempting to appeal to her sister. Athena doesn’t respond as the olive tree display produces two giant olives. She takes them, bursts them in her hands, and the juices flow across her body to form armor. \"Artemis, please, for once understand that what must be done must be done,\" Zeus pleads. \"Understand? What is there to understand? All I see is the impulsive punishment of the innocent, and this supposed gleaming beacon of wisdom finding all this justified,\" Artemis didn’t spare a glance to her father, keeping her eyes trained on Athena, trying to will those olive roots to sprout and root her feet to Olympus. \"Artemis, I have been far more patient with you than I should have been because I love you. Now quit this animosity you are building between you and your family,\" Zeus says in a tone of warning. \"Animosity? I will show you what animosity really is when I meet you on Plyscithia,\" Artemis shoots back, a wild ferocity sharpening her eyes. \"No! You wouldn’t dare stand against your father!?\" Hestia looks up from her kneeling position. Artemis glances down at her, and is disgusted by how weak, pitiful, and helpless she looks. \"I will have order in my home, Artemis, and I will spare you no mercy if you lash out this way. I demand that you either follow the lead of your aunts and standby, or, better yet, follow the lead of your reasonable sister, and assist in this operation,\" Zeus says. \"Reasonable? A cleverness that sells the dignity of others just to suck up to a fount of hypocrisy is reasonable?\" \"You will be expelled from Olympus, and cast out from our family indefinitely, if you follow through with your suggestion. I will not hesitate, even on my own flesh and blood,\" Zeus promises, sending Hestia into a fit. Demeter rushes to assist her sister, leaving Artemis standing alone. Artemis balls her fists up in absolute frustration. Tears have been streaming down her face this entire time, but it feels as if a fresh flood erupted. Through the blurriness, she can hardly see Athena anymore. The shine of her armor is the most visible."
            },
            {
                "name": "First Descent",
                "text": "A massive golden arrow pierces through the clouds. Both wildlife and those who protect it look up at the familiar sight of the ultimate protector making her return trip to her lands. Yet, the glow isn’t as bright as they are accustomed to. The incoming warmth is missing. Speckles of black dirty the divine projectile. It pierces the canopy, and the life in its path is physically unscathed, but it feels the immense, corrupting sorrow reflected in the strange new aesthetic it carries. Usually, this arrow would lodge into the earth, and its pilot would emerge as though she hadn’t been hurtling through the air. But, she doesn’t reach the ground this time before she is ejected. The light splinters at the arrowhead, and her body breaks through. As the arrow dissipates into shards of bark, and fades from its original golden to a whiter moonlight hue, Artemis hits the ground and tumbles. Her angels rush to her aid, bringing a variety of concerned fauna with them. Artemis lays on her back, exhausted by emotion and anguish, and just stares at her caring underlings as they try to diagnose what has gone wrong. The more sensitive of them toss around ideas regarding the vague sense of dread they’ve been feeling for a while now, but they remain clueless. Artemis closes her eyes as hands inspect her body. She sees small sparks here and there, distant and muffled booms. Then, a larger explosion illuminates her mind’s eye like the morning sunlight behind waking eyelids. Before she can process what she witnesses, something akin to having her guts twisted jolts her up in pain. She gasps for breath as the angels give her space. Her eyes are wide open, but they stare not at the grass in front of her, but at a burning garden of memories – every futile disagreement she has made and the buried trauma she suffers from those who are punished by what she can’t avoid comes back to her, engulfs her. What is happening to Plyscithia is merely a continuation of what has already happened to so many other people and places... a continuation of what happened to her. Was she doomed from the womb to suffer through the same core of injustice which begat her? Yet, she knows that this event is special, the magnitude is too great, and she is already at a breaking point with all that she has stored. What should she do? Betray family? Suffer exile? Well, she certainly hasn’t felt like she has had a family up there in a while… but, being cast out? What would she do then? What power will she have? Who will stand up for those who can’t represent themselves in front of this cruel council? Family...  Artemis gets up on her feet with a huff. Her expression darkens further than it had when Athena first saw her today. The angels give her space, now silent at their goddess’ soundless and sudden movements. As she wordlessly walks away from those who tried to tend to her, she, like her sister before her, covers skin with armor. The tufts of grass she tore out of the ground when she stood up adopt a distinct, brilliant emerald. Despite being small blades, entire trees burst from their tips, snaking their way around Artemis’ skin. The dark bark especially shields her upper arms and thighs, unwinding into thinner branches that outline her hands and feet. Her head is encased entirely in a wooden helmet, and, from there, the bark embeds itself deep into her throat and chest. It swirls around her heart, creating a black abyss of a cavity from which a violet pulse emerges periodically and flows throughout the rest of the covering. Using the last leaves in her hands, she claps her palms together. A purple explosion detonates between them, then she extends a bow as she pulls her hands further and further apart. It drips with a violet liquid which constantly emits smoke, causing the entire bow to be enveloped in a fog of its own. Artemis yanks an arrow out of the bow’s bark, and slashes across the air in front of her in the process. It bleeds the same purple oozing from the bow, and now spilling from the aperture over her heart. This venom burns a wide hole into the empty space itself, and Artemis steps through as her followers watch in confused awe."
            },
            {
                "name": "Banished Delos",
                "text": "Artemis arrives on a barren island. It floats through the surrounding sea as a giant buoyant rock, lacking any attachment to the depths below. \"My precious baby girl…\" an echo reverberates lovingly through Artemis’ mind. It immediately comforts her, and the poisonous rivers bleeding down her body begin to thin. \"Mother…\" Artemis responds. \"Your voice...you sound so...tired…\" \"I need your guidance, now more than ever.\" \"I can tell. Your mind is in more distress than I’ve ever felt before. However...there is a dark resolution in your mind gradually forming. I can’t sense it clearly, though.\" \"Mother, I’d like to talk to you on a more intimate level about this.\" \"What do you mean?\" \"The snake will no longer be between us.\" \"Artemis, no! You know what will happen if you slay it and free me! You know it must be this way for your seat at Olympus.\" \"I am debating whether to keep that seat or not, and I need you to assist me face-to-face. As much as it hurt to try to communicate to you through your prison of scales and coils, we could work through the problems of the past just fine,\" Artemis begins scaling the island, bounding across foot and handholds, rooting the tree which decorates her into the hard rock to climb when she couldn’t jump. \"Unfortunately, the issue I face now is not one easily solved, but it presents a rare opportunity of distraction for Hera, so I will capitalize.\" \"I...I understand. Please, my baby, be careful.\" \"I will, Mom. I will.\" Artemis makes one final leap, reaching the island’s flat land at last. The dreary expanse of hard, cold, withered terrain lifelessly leads toward the center of the island, where layers upon layers of translucent, crystalline coils wind into a massive superstructure. Artemis can vaguely see a dark mass behind it shifting around. Upon recognizing this place, and vividly remembering the countless times this nightmare of a prison has also served as a shrine of wisdom and motherly love, a long-standing frustration makes itself more present than even the pain she feels from Plyscithia. The poison can’t numb this. Though, where in the past Artemis would keep this frustration in check as much as possible, she now allows it to envelop her as much as the maternal care she appreciates. She allows it to override all other motivations, and the poison rivers flow with a renewed vigor. She approaches the outermost layer, leaving a trail of footprints eroding the rock she walked across. Her palm lays against it. It used to be unresponsive to her most desperate pleas for mercy for her mother, but it seems that the ancient architect now understands Artemis will do more than just helplessly grovel. Her palms feel the vibrations of the dark mass moving. Her intentions agitate it. Anger it. Artemis presses forward, pushing her hand through and burning the layer away. It folds into itself as its crystals weaken, its fabric-like surface bending to Artemis’ will. The outlines of tree branches on her hand gather at her nails, and then produce vicious claws. She punctures the fabric, and tears it away. On cue, a roar booms through the layers as a warning. Artemis receives it as a dare. She uses both hands to begin shredding her way through the layers, running deeper and deeper into the lair of shed skin. Her eyes adjust to the darkness she dives into, her armor producing its own lavender bioluminescence to counter it. This also makes her an obvious target for the beast thrashing in anxiety ahead, but she doesn’t mind. The quicker they can meet, the quicker her goal is met. A distinct glow blossoms in the darkness ahead, generally around the area of the beast. She can smell the concentrated malice swirling, growing stronger. Artemis ignores the urge to vomit as she stops and nocks an arrow. As she pulls it further and further back on the string, more and more rivulets of venom swirl into the body of the arrow. It especially coalesces at the tip, forming an expanding sphere of flowing violet. She lets the arrow loose, the sheer power of its release blasting apart more of the translucent layers around her. It rips through the crystal walls, and meets the launched glowing mass which started descending immediately after the arrow’s release. They meet beyond the halfway point, right in front of the dark creature, and it roars as the ensuing explosion grazes it. Artemis is silent, though, and solidifies a purple tether of flowing liquid poison which connects her arm to the arrow. She tugs what is now a rope, and yanks back an orb amalgamate of her arrow’s power and the energy launched at her. She catches the ball, then shoves it into the hole over her heart, locking it deep into the abyss. The wood of her helmet unravels around her mouth and nose to give her room to hack out several coughs. Gooey, black phlegm spatters the crystal floor beneath her. She clears her throat and spits a fat wad out. The black goo now has viridian veins pulsing through it. Her helmet reforms around her mouth, and she leaps back, narrowly dodging the destructive plunge of the dragon in the nick of time. Her armor’s signature color changes from the purple it has been to the green in her phlegm, and she lands on one of the huge chunks of ground that broke into the air from the snake’s headfirst impact. She readies a second arrow quickly, and just as she is ready to fire, the maw of the serpent bursts through the cloud of debris she is aiming at. She lets the arrow loose into its mouth, shutting it right up as it chokes on the shot. However, this focus grants her no time to dodge the snake’s upward lunge, so its snout slams into her and sends both of them even higher into the air. Artemis slides herself off the nose as the snake ascends, and she falls along the length of its body. The further she falls, the further she pulls yet another arrow back. From below, her mother, Leto, watches as the serpent’s ascent breaks through the black, crystal ceiling and sheds moonlight on her for the first time in ages. Though her eyes are dazzled from even just this, she borrows the sight of her brave daughter, and witnesses a piercing green light shatter through the snake’s scales, which she thought to be practically indestructible, from the inside-out, then wrap itself around the length of its body and keep it static as it sailed. Artemis’ third arrow guides the direction and size of a much larger arrow which forms beside her. She releases this gargantuan shot and impales the snake length-wise before breaking her bow in half to detonate it in a blinding emerald display of rapid plant growth. The light dies as Artemis’ back craters the ground next to her mother, and she can see that a massive wolf-like wooden organism has suspended the snake’s captured body in the air, the base of it rooting in the ground at the angle of Artemis’ arrow’s trajectory. A mix of green and purple foliage grows from the black branches, prettily decorating the gruesome sight. Flowers blossom beneath the moonlight from base to crown as well. These flowers spread across the shed-skin bubble which contains Leto, growing as they feed off it. Once they have their fill and their area of the bubble is fully eaten, they burst into sparkling petals. Leto runs through the petals to her daughter’s aid, and lifts Artemis’ head off the ground softening with rock crumbling into soil and sprouting wild weeds. Artemis’s armor strips itself away from her skin, retreating back to the leaves they originally were. Her hands, swollen and exhausted from their effort and the poison, are open, so the leaves fall from her palms and join the slow-growing foliage. Artemis’ eyes stare at the moonlit snake tree as she steadies her breath, ignoring the silent weeping of her mother as she holds her in her arms. Artemis shrugs off an enormous tiredness which grips her body, coughs a little, then sits up on her own. \"Are you alright? I was so afraid seeing you fight Hera’s monstrosity…\" \"Yeah, Mom. I’m alright-\" Artemis turns her head to hack out a vicious cough, and spit one final glob of tar. She wipes her mouth with the back of her arm, then tucks her silver hair behind her ear to see her mother well. \"Finally,\" she mutters, throwing a loving hug around Leto. Leto reciprocates with the double helping of a caring mother, and they stay in the embrace under the moonlight for a while. A sobbing silence occupies them for a time until they are ready to speak. Artemis is the first to hesitantly pull away. Before saying anything, she locks eyes with her mother, and they stare deeply. They assure each other that this is reality. With some confidence in that idea built, Artemis breaks the eye contact and looks down at the grass that has sprouted between them. \"An entire planet…\" Artemis whispers. \"I know...I felt it through you.\" \"And I still can’t do anything without losing my place among them,\" Artemis sniffles. \"I still can’t do anything without threatening their precious balance.\" \"My daughter...my strong woman, I know you can see through their balance for what it is...and I know you can also understand what true balance is.\" \"I don’t want to understand such an abusive concept.\" \"You, more than anyone else, understand how words and ideas can be twisted to fit one’s true intentions. You told me about witnessing that time and time again whenever you came down here,\" Leto shifts her position, kneeling behind her daughter, and hugging her. She kisses the top of her head, then places her hand over Artemis’ chest. \"I saw and felt how your heart bled, not just to fuel you in battle, but to empathize with those being hurt. These feelings you hold, and the passion you wish to act upon...those are a part of the balance.\" \"But, then can’t you also say that the abhorrent impulses of my brother and uncles are also a part of it?\" \"Smart woman. That is absolutely true. Though, if they weren’t like that, you wouldn’t be feeling like this, would you? As your moon influences the push and pull of the seas, so too does your passion influence the push and pull of balance. Artemis, my dear, your passion is the proper counter to their malice. You are the true harbinger of balance, not them.\" \"But, what about my place among-\" \"Clearly, that place restricts the potential you have. I also feared the consequences of your expulsion, but not because of the stifling of your voice, but because you might not have had enough motivation for your voice. I see you possess more than enough now, though.\" \"Can I really…\" \"Save Plyscithia? Well, balance certainly demands that you try. The arrow of fate flies strange, yet the archer will find its balance in the wind.\""
            },
            {
                "name":"Second Descent",
                "text":"Artemis returns to her home through a portal that isn’t as grotesque as the one she exited through. It’s her usual one that her angels and animals are accustomed to. Two deer bucks join horns, then carefully step away from one another, the horns now attached and growing with the distance, keeping connected. They form a large aperture between them, and through the empty air steps Artemis. The relief that she is no longer in her dark armor is immediately overtaken by the surprise at the sight of her returning with someone else. The seraphim are most surprised, having the power to identify the energy Leto exudes, how similar it is to Artemis’ and connecting that to Artemis’ vague stories about her mother. However, there is no time for introductions. For as normal as Artemis is dressed, her gait is brisk and her expression is serious. At least, it isn’t as dead anymore, and the angels think their thanks before Artemis speaks. \"We have very little time to waste. As some of you may feel, and as some of you may have heard from your sisters, the planet of Plyscithia is undergoing severe punishment under the authority of Olympus,\" she quickly recaps as a golden bear and a red wolf simultaneously emerge from the forest. Her angels are surprised, recognizing Artemis’ most powerful bow and hunting knife. The bear transforms into the divine bow and the wolf transforms into the blade as she pets both animals on their heads. \"We will not be participating in the punishment, but rather…\" Artemis’ mouth goes dry before she can complete the sentence. Declaring this to herself and her mother is much different from declaring it to her angels and their followers. In trying to save Plyscithia, she will be dooming some of them. Artemis is much more accustomed to shielding them from the brunt of the danger and pain she faces, sacrificing herself for them, but now she must...command them into such a perilous situation. Perhaps...she hadn’t thought this through well enough. Maybe this is a passion only she has, and one only she can carry out- \"They wouldn’t be your angels if they did not carry the same passions you do,\" Leto says into Artemis’ ear, her hand gently placed on the goddess’ back. \"Just as you are ready for this, they are too. Just look...\" Artemis hadn’t realized that she spaced out into her insecurities until her mother snaps her out of it with her reassuring words. Now present, she notices a growing number of armed and armored angels have gathered, their familiars fit with gear as well. Be it vines wrapping themselves into the shapes of shields, fruits spilling their juices to create fluid, liquid weaponry and protective cloth, or animals mounting arms, legs, and backs to fuse into extensions of a greater combat unit, Artemis’ variety of warriors display their readiness for a battle she might have avoided in another time. \"What’s with the surprised look?\" asks a young woman, testing her swings and twirls with her ibex-horn shotels. \"You thought we weren’t with the shits since day one?\" \"N-no, not that, just…\" \"You didn’t make us your angels because we’re cowards, Goddess,\" reminds a young man whose small dragon had become a pulse rifle. \"Besides, even if we haven’t been able to express our frustration at the conflicts which plague your thoughts, it isn’t as if we haven’t honed our skills elsewhere.\" \"True…\" Caught up in her own anguish, Artemis failed to see how prepared and committed her own angels were. She chuckles a bit, realizing how shortsighted and deluded she had been in her concerns. \"Well, then I take it you all understand the gravity of our actions.\" \"I’m happy you won’t have to associate yourself with abusers after this,\" admits one of the seraphim, whose double voice speaks without the movement of its firetooth-filled maw. \"As am I. Gorin, Kun, and Jesha, your units will stay here and guard Leto, my mother,\" Artemis commands. The addressed seraphim nod while lesser angels gasp and widen their eyes at this revelation and the implied consequences. \"The rest of you, gather on Plyscithia. I will transmit battle plans along the way. We will have multiple fronts and jobs to perform in its defense, but, rest assured, we will stop Olympus from wreaking havoc.\""
            },
            {
                "name":"Liberation of Plyscithia",
                "text":"The Plyscithian situation requires flexibility from Artemis’ reinforcements to her angels already stationed there. Where the conflicts are enacted through more legislative and structural means, popular efforts and organizations led by her angels are bolstered in their efforts to shelter, educate, and provide for local communities while strengthening efforts of political agitation, criticism, and representation. Other areas have sparked into warzones over land acquisition and civil rights, and this is where Artemis makes her presence most known. She leaps through a dense jungle with several parties, leading angels who have been assisting indigenous communities in their acts of resistance. As a primary force of anti-government militias and government detractors face the might of a private military corporation head-on, Artemis circles around the main conflict zone to gather information, find weaknesses, and identify key leaders. \"We’ve identified a number of CraggCorps officers, among them one of the top generals. But, of course, he is protected by much of their infantry and armor, as well as specialized guard units,\" hisses a huge lizard humanoid with a giant crossbow that’s more like a ballista. \"Hermes is also with them. You can’t see him or his angels, though. I will try my best to draw them away and cause confusion so I can hunt him. Strike when light flashes above them,\" Artemis says as she breaks off from the group. The lizard gives the signal for all parties to halt. Artemis sneaks her way to one point in the jungle which places her behind the right flank of Hermes and the general. She fires a bright arrow above Hermes and the general which explodes in a flash of light, splinters a smaller arrow into the dirt beneath them, and surrounds Hermes, the general, and their guardsmen under a tough bearskin bubble. Or, well, it would have covered all of them if Hermes wasn’t quick enough to react and slide himself under and out of it. Artemis watches her subterranean shot zip toward Hermes’ escape route quicker than even him. It pops out of the dirt, then expands into a giant bear trap. Hermes notices this too late, and suffers an entire leg captured between the jagged teeth. His wails of pain are accompanied by hurried whimpers as he finally detects an incoming Artemis by her divine signature, previously cloaked to prevent him from noticing while he still had time to dash away. He struggles to pry the trap open, and he successfully does so, but Artemis is practically on top of him, and his severely bleeding leg makes it difficult for him to reach even a fraction of his top speed. He quickly stumbles through the jungle floor, fighting thick roots and intrusive branches as the hunter closes in. To ensure that not a shred of fortune can reach Hermes before his death, she takes out her blade and rushes to pounce on him. She makes the final leap as he falls onto his back from a massive beetle pinching his other leg with its mandibles. His lyre materializes, and he lets off a strum just as her knife plunges through it and severs several of his fingers as well as some of the lyre’s strings. A massive axe materializes mid-swing in the air right beside Artemis, and she’s forced to clash her knife against it. Hermes’ good leg kicks Artemis in the abdomen, sending her into the sky, and the hunk of muscle with the axe follows after her. Another clash of blades blasts Artemis further upward. She spares a brief glance towards the primary battlefield, and sees several angels of Hermes splitting off from the surprise attack they are caught in to reinforce Artemis’ assaulter in the sky. Her piercing glare refocuses on the axeman and her bow materializes. \"Alright, Ares. You wanna play?\" She fires a shot beyond him. It lodges into a tree in the jungle below. \"We’ll play on my terms, then,\" her body flickers just before Ares’ axe can sink into her. Artemis is by her arrow in the jungle, and she cloaks her divine signature once again while slipping into a tree trunk. Ares descends from the sky with a slam, uprooting multiple trees and cratering the soil beneath his landing zone. The angels of Hermes that accompany him catch up, and survey the area for any sign of Artemis. \"If I knew you’d be fighting this fiercely, sister, I would have brought some of my soldiers to battle against yours. But, I’ll settle for taking all of the glory in your defeat,\" he says loudly as he stalks through the silent jungle. An explosion back at the battlefield booms across the forest suddenly, and Artemis takes the opportunity to emerge out of some mud and drag one of the angels back in with her. Upon walking too close to a tree, an angel is silenced by Artemis with her hands on her mouth and throat, then fused into the bark. Through the ecosystem, both in terms of flora and fauna, Artemis notices the battle worsening for the defenders of Plyscithia. Ares is spreading his power into them as he hunts for Artemis. This is obvious bait to get her desperate and reveal her position, but Artemis is the hunter here, and Ares will remain the prey. She steps out from behind a tree and snipes another angel, the arrow caving his face in and pinning his head to the tree behind him. Artemis steps back behind the tree, but when Ares fires a beam from his axe to blow the entire tree up, there is no one around. Immediately after the blast, two Artemises appear. One dives from a tree branch and slashes the throat of an angel before slipping into the ground while the other slashes her knife across the belly of another on her way past. Three more appear and do similar strafing runs. Four more appear and fire arrows. Five more with throwing knives. Six more with spears. The entire area around Ares and the others is full of Artemises taking one angel out after the other, and no matter how much firepower they blast into the jungle around them, anything from ice bombs to fire pillars to slicing gusts of wind, from attempts to dash into the Artemises and tackle them down or run them over to kicking up dirt and trying to destabilize them with tremors through the soil, it is all ineffective against the onslaught. Ares keeps calm in the chaos, however, and focuses on Artemis’ center of divinity, the greatest mass of her power. He plunges his axe into the soil below him, cleaving Artemis’ skull in two with a violent spray of blood showering him. His satisfied smile relishes in the conquest until the blood on his face begins to sizzle and sting. It coalesces around his eyes, blinding him, and Artemis’ upper body emerges from the blood on his face, an arrow in one hand and her knife in the other, prepared to put the shocked Ares out of commission. Right before the tips can destroy his brain, though, a jolt goes through Artemis’ heart. Quickly, she leaps out of the blood, kicks Ares to the floor, then spreads her power to her allies in the midst of battle. Afterwards, she fires an arrow into the heavens, becoming one with the shot and transporting herself straight up to Olympus."
            },
            {
                "name":"Third Descent",
                "text":"Artemis breaks through the ground beneath Hera’s feet, and the tip of her blade misses the back of Hera’s head by a hair. The Queen of Gods teleports away in the blink of an eye with her hostage, then reappears and holds her own knife to Leto’s throat. \"If it was not so convenient to distract you this way, I would have murdered your mother the same way I slaughtered the pitiful defense you set up for her,\" Hera admits, much to Artemis’ shock. She directs her far-seeing attention away from Plyscithia for a moment to survey her lands and feels the agony in what little life struggles to survive under the painful prick of...arrows. Millions of arrows of light, pinning her angels into the dirt where their blood feeds the flowers as they are nourished by the sun. \"I say I, but your brother did most of the dirty work. A thorough, loyal, and reasonable brother he is. It’s a shame he was birthed by this spiteful whore of a mother, and raised beside a disrespectful mass of excrement like you,\" Hera spits in Leto’s hair, and yanks it. Leto tries to stifle her pain. \"I hope you enjoyed killing Python and freeing your mother, because I will certainly have more pleasure ending her life and imprisoning her in Hades, where you certainly cannot reach her,\" Hera smirks. Artemis is on top of Hera before the latter can move another muscle, attempting a downward slash. Hera tosses Leto aside by her hair, grabs Artemis’ descending wrist with her other hand, then uses the hand which freed Leto to drive her palm into Artemis’ heart. Artemis is stunned briefly as Hera rips out an oversized lily flower. The petals grow more tentacle-like, and latch onto Artemis’ face, forcing her to stumble back in surprise. When she’s able to rip the petals off, Artemis sees her mother in front of her, standing, looking fragile and helpless. She almost buys into the image, but she looks around first and also sees her mother broken and battered on the ground beside them. Immediately, Artemis relaunches her attack with her knife at the standing Leto. Twirling and spinning, Leto deftly dodges the slashes. She can’t dodge, however, the arrows of water which pierce her legs, sourced from the Plyscithian jungle dew still on Artemis’ blade and now spread across the ground through her slashes. Caught in this trap, Leto’s neck suffers Artemis’ crushing grip, and her head suffers a slam into the ground as if she is some wrangled beast. Artemis stomps the crater that crowned Leto’s slammed head as the copy quickly bursts into pomegranate seeds as an escape. Artemis turns to witness the seeds reforming into Hera, and uses the dew to accurately stab as many as possible. With so many seeds caught by the dew, Hera is forced to reform exactly where Artemis predicts she will, and catches a knife to the belly before she is complete. To make sure the job is done, Artemis twists the blade, then slashes across the abdomen, ripping through it all to finalize both corporeal and spiritual death. Hera falls to her knees, and, with tears in her eyes and outstretched hands, falls dead pitifully. Artemis sighs, then turns to look at her mother who rises from the ground slowly. Artemis rushes to her side, helping her to stand while inspecting her injuries. \"Mom, mom, take it easy. No need to rush, are you alright?\" \"Please..please, you cannot hurt your brother for this…\" Leto’s breath is quick as she says this, and Artemis clenches her teeth, subduing her rage to concentrate on her mother. \"Lucky for him, my passion to take care of you is my priority,\" she responds, before sensing others around them. Artemis turns to see Zeus and Poseidon watching both of them. \"C’mon mom, we gotta go quickly,\" Artemis says, picking her mother up. \"I’ll let you rest once we’re out of here.\" \"You cannot hurt him...because you will not be able to,\" Leto finishes, looking into Artemis’ eyes. Her quick breaths ascend to a shrill laugh. \"M-mom…\" Artemis trembles as her mother’s face is slowly overtaken by Hera’s. Hera blasts Artemis away from her as she completes her transformation, then dusts herself off wherever Artemis touched her clothes. Artemis lands by Hera’s dead body, and watches in abject horror as it shifts into Leto’s true, withered, soulless husk. \"Brother, remind me of why our Goddess of the Hunt holds her position despite her utter failure here before our eyes?\" Poseidon asks. \"We must regrettably search for a new holder of the domain. Regardless of her failure, Artemis displayed explicit intent to not just harm a member of Olympus, but wipe their existence from this realm permanently, drawing her strongest weapons and greatest powers to perform the effort. This intent is inexcusable, beyond deplorable, and warrants more than just banishment, frankly,\" Zeus declares. \"You are no longer an Olympian, my dear daughter. Cease your efforts on Plyscithia immediately, or we will respond with force to match what you have displayed here.\" Artemis swallows as the order hardly processes. She touches her mother’s body, inspects the rift she made through it, comes to grips with the reality of her entire existence erased. Without a glance or sound towards anyone else present, Artemis picks up her mother’s husk and flickers away. Using the last of the power she is willing to spare for any reason, she forcefully recalls all of her angels from their efforts on Plyscithia. As usual, only the seraphim bear an inkling of why this has been done. All others merely watch as a white lake of maggots wells up from the ground and the skies above darken with vultures, joining the audience of Artemis’ mourning."
            },
            {
                "name":"Notable Rubrachromicon Entries",
                "text":"[Artemis’ Ouroboros Armor (Corrupted)] Despite the target she dons the armor to fight against, and the name of the armor, this armor is not exclusively used to battle against serpents. It’s strongest against targets of divine origin which bear a unique, and exploitable, universal construction. The hole in the chest of the armor allows the wearer to process energy directly from their target, and produce an effective counter-energy to obliterate it in however way their own energy affinities deems most fit. This is why Python is turned into a massive tree through Artemis’ final attack. The armor, as it is shown here, is corrupted because of the constant pain Artemis is experiencing via Plyscithia’s destruction, as well as her weakening link to the center of her divine power: Olympus. The corruption makes it so that the armor must dig deeper into Artemis’ spirit than is usually necessary, to depths that she isn’t, and doesn’t have the time to be, trained for. [Artemis’ Final Hunt] A weapon set consisting of a golden bow and a red hunting knife. When equipping them, the user is also adorned with armor matching their aesthetic. These weapons are constructs of Artemis’ existence combined with the raw divine energy produced from Olympus. As such, not only are they the perfect weapons for Artemis and arguably the most powerful bow and knife to ever exist, they also have the ability to completely erase a spirit from existence. It follows that the armor they produce around Artemis is both keenly intune with her being, and protects her from most forms of even serious divine or existential damage. It is a gift from Hephaestus, one of Artemis’ best friends among the gods associated with Olympus. He crafted them for her both as a sign of gratitude, but also out of anxiety for a time when she might need to use them against divine targets that are better off permanently killed; he had always imagined it would be him considering his own pent up rage due to the abuse he has faced. [Banished Delos] Artemis’ heaven is located in a realm parallel to, but otherwise removed from, the Delos recognizable on the planet Earth. Artemis’ mother, Leto, was banished by Hera to a prison-like version of the island which exists in relation to Earth’s Delos in much the same way as Artemis’ heaven. Leto was imprisoned here for her participation in an affair with Zeus, the same one which begat Apollo and Artemis. During Leto’s imprisonment, this version of Delos was little more than a lifeless rock dominated by Python. But, now it is an island thriving with life, and settled by Plyscithian refugees. [Python] Hera assigned Python, a giant serpent from the depths of the Infernal realms, to guard Leto. It can be called a serpent, a snake, a dragon, or some other approximate noun for a giant lizard of its kind. Its molted skin forms the entire prison structure around Leto. Captured, empowered, and ordered by such a high, divine authority, Python possesses ridiculous strength and Artemis was unlikely to defeat it had she not exploited the weakness inherent in its universal construction through the Ouroboros Armor. [The Battle of Inyestra, Plyscithia] The most notable wartime battle of Plyscithia amidst a half-century of general global chaos. This battle takes place during the Inyestran-Karbal War which sparked when the archipelago nation of Karbal retaliated against years of aggression from Inyestran citizens within their islands, as well as abuses against the Karbalese ethnic group within the Inyestran country. Tensions in the war heightened further when a spree of mass rapes upon the Karbalese ethnic minority was perpetrated in Inyestra, and a diplomatic envoy of Inyestran officials harassed female Karbalese royalty on their own national soil. This precipitated into the Battle of Inyestra, taking place in the jungle countryside west of Inyestra. The Karbal forces, joined by other ethnic minorities and oppressed revolutionary groups of the country, stormed into the jungle to fake an invasion into the large western cities of Inyestra. The Inyestran military and its private military support responded by meeting the Karbalese in the jungle — a mistake they paid for dearly. With smaller numbers, better familiarity with the land, and time to prepare ambushes, the Karbalese effectively crippled the Inyestran military over the course of a week. Early in this battle, it seemed as though the Karbalese would actually fail horrendously due to Artemis stripping away her angels from the planet. However, Mara, the Infernal God of Suffering, reinforced them in response to the grossly unbalanced presence of suffering throughout the planet. This led to the Karbalese victory, followed immediately by Inyestra’s desperate nuclear attack on the jungle. As far as the average Plyscithian exposed to news of the battle, and war, knows, the war ended with both Karbal and Inyestra wiped off the face of the planet in nuclear fire, with no survivors. However, the only casualties were on the Inyestran side, and only those directly involved with or complicit in the injustices committed during the war and in the events leading up to it. Innocent Inyestrans and most Kabalese were transported to Banished Delos before they could be incinerated or suffer from the nuclear fallout."
            }
        ]
    },
    {
        "name":"Replay",
        "part":[
{
    "name":"Onboarding",
    "text":"\"Whiskey, please,\" Artemis answers, her sharp nails digging into the leather of the seat. It is comfortable, but her sobriety takes away any semblance of comfort from the air-conditioned room and the plush padding beneath smooth leather. Cambia notices her grip on the leather, as well as her terrible attempt to hide it, but he doesn’t bring attention to it. \"Serving alcohol to a goddess applying for a position at the University isn’t a situation I’d ever imagine myself to be in,\" he pours the whiskey into a glass. \"But, here we are- oh, dear me. I forgot to ask if you wanted any ice.\" \"No ice, thank you,\" she responds quickly. \"Oh, how fortunate,\" he picks up the glass, then goes across his headmaster’s desk and extends the glass towards her. \"Feel free to ask for more any time.\" \"May I have more in the glass?\" She requests immediately. This takes Cambia visibly aback a little. He notices her swallow. He holds eye contact with those dark eyes for a few moments. The trauma is palpable, and for all his majesty, he feels fear in wondering what may happen should the rage of that trauma be unleashed upon him just for hesitating in fetching Artemis more whiskey. \"Of course, goddess,\" he responds. Instead of going back around his desk, he simply reaches over to get the bottle, puts the glass back down on the table, then starts pouring in front of her. \"Tell me when.\" Artemis’ eyes train on the cup, and she remains silent. Cambia continues pouring. And pouring. And pouring. Whatever anxieties and objections he may have are inconspicuous in his body language. And pouring. And pouring. \"Stop,\" Cambia smoothly and quickly halts the stream of alcohol at Artemis’ command. The glass is so full that the whiskey creates a small bump in the center, contained by the lips at the edges. \"Oh my, this is too full for my nervous physical hands to deliver. You don’t mind if I use some magic to hand it to you, do you?\" He asks with a kind smile that begs for forgiveness. \"No…?\" Artemis answers, her eyebrow slightly raised. \"I apologize if there is any confusion,\" Cambia turns his hand palm-up, and his index finger, its nail like a claw, uncurls toward the glass. Red Infernal energy swirls around the bottom of the glass, and lifts it up off the desk. The glass slides across the air, and Artemis receives it with a vine which splits into a wolf’s open mouth as a cup holder. \"But, not too many of our Elysian staff really enjoy being in such close proximity to Infernal energy,\" Cambia says once the glass is securely in Artemis’ possession. He goes back around his headmaster’s desk, and sits down in his swivel chair. \"It’s all the same arrogance, just in different flavors,\" Artemis comments as she takes a large gulp of whiskey. \"As an Infernal demon myself, I understand that all too well,\" he laughs. \"Though, I don’t extend that judgement towards you. You’re one of the few I truly respect...admire, even. I have heard a lot about you, and your efforts, through some divine contacts in the University.\" \"It’s alright to say that buffoon’s name around me.\" \"Mara.\" \"Nevermind, I take that back,\" Artemis says seriously, wincing at the mention of Mara’s name in contrast to Cambia’s laughter. \"Do I have the job or not?\" Artemis asks impatiently before drinking more. \"To be direct, yes, you do. Else you wouldn’t be sitting here in front of me. I simply wanted to take some time to know you better. I am very excited to have you at the University, and I sincerely believe your mere presence, let alone your wisdom, would greatly benefit the students. Forgive me if I am already being too familiar, but I would like you to be as comfortable as possible here. You’re among allies, and, hopefully, friends too, down the road.\" Artemis bristles and blushes in discomfort at the warm welcome. Her legs shift beside each other, anxious to get out of the headmaster’s office. She distracts herself by finishing the whiskey. She hopes this display of alcoholism would be enough to earn a lower temperature from Cambia, the coldest shoulder ideally. But, reopening her eyes and putting down the glass at his desk only allows her to see that smile of his. That genuine smile of his, unlike the fox-like smirks and predatory serpentine grins that Mara warned her about. He really does want her here. He’s willing to work alongside a broken person like her. \"Well, if that is all, then I’ll be taking my leave,\" she declares, standing up quickly. Startling Artemis, Cambia moves at an inhuman pace, and is by the coat rack before she is. \"Allow me,\" Cambia offers, taking her coat off of the rack and handing it to her. Once she breaks free from her stasis, Artemis blinks quickly and takes the coat. By the time it’s on, Cambia is already at the door, holding it open for her and inviting her through...with that smile of his again. \"Don’t hesitate to explore the campus while you’re still here, along with your personal office and your lab. If you ever need a reminder of where any of that is, I would be more than happy to guide you in any capacity.\" \"Th-thanks…\" she says, his speedy, open hospitality shutting her brain off for a moment. She shakes off the malfunction, then exits the office. The angel standing sentry by the door follows Artemis as she walks away.  It isn’t long until Artemis is back in the rain, where she had accessed the rift into Succubus Wing University’s campus on Earth. She makes no effort to conceal or gradiate her re-entry into the conventionally existent spaces of the mortal realm, so a few people notice a woman and her bodyguard who weren’t there a second ago blend into the normal walking crowd. Artemis and the angel are flanked by three more angels, and a fourth meets them at a black car to open the door for Artemis. However, they do not immediately open it, and instead make eye contact with Artemis through their shades. Artemis is confused at first, but once she escapes the suffocating thoughts of how off-putting Cambia’s welcome was, both coming from a person like him, and directed towards a thing like her, she feels the presence that the angel is staring at her about. Artemis rolls her eyes, then opens the door herself and leans into the car to see Mara comfortably sitting inside. He apparently went through the pain of dressing as business-like as she has, though he clearly can’t handle being so stuffy about it considering his visible chest and sneakers. \"I know I rule over suffering, but you don’t have to indulge me so much. I already get my fill from mortals,\" he says in response to her audible groan and distinct, sudden annoyance. \"Maybe if you weren’t in my car, I wouldn’t feel this way,\" she hisses at him. \"You couldn’t feel me before you got here?... Did Cambia really leave that much of an impression on you? Well, don’t stay out there in the rain, come in here and tell me all about it!\" he invites excitedly, patting the seat beside him. \"Ugh…\" As much as Artemis dreads a car ride with Mara, she doesn’t want to miss this natural rainy night. After some frustrating deliberation, she orders some of her angels to follow by other means or go to Delos. Some protest in concern, but she assures them that she’ll be alright, that Mara is the farthest thing from a serious threat. Trusting in Artemis, they depart, and she sits in the backseat with Mara. But, she sticks to the door beside her as much as possible, and she only looks out the window at the rain as the angel in the front begins driving.  \"So cold… So, how was it, meeting him?\" Mara asks, holding off on the enthusiasm now. \"You have no shortage of strange friends, even nowadays,\" Artemis responds, trying her best to enjoy as much of the pitter-patter rhythm of the rain as possible. \"Don’t let the way he smiles put you off, it’s just how he is-\" \"His smile was genuine.\" \"...I didn’t expect him to be able to trick even you-\" \"No, there were no tricks with him. His smile was genuine the entire time.\" \"Hmm…\" Mara looks out the window and considers a genuine Cambia smile for a moment before speaking again. \"Well, he’s carrying the weight of the reputation of my friends on his shoulders.\""
}
        ]
    }
] }
]